{"data": "# 大一学弟的寒假总结，佩服！\n\n> 本文作者：[程序员鱼皮](https://yuyuanweb.feishu.cn/wiki/Abldw5WkjidySxkKxU2cQdAtnah)\n>\n> 本站地址：[https://codefather.cn](https://codefather.cn)\n\n大家好，我是鱼皮。\n\n最近很多小伙伴们都陆续开学了，不知道大家寒假都做了些什么？有没有好好享受这个寒假呢？\n\n![](https://pic.yupi.icu/5563/202311051951891.png)\n\n我记得我的大一寒假过的很充实，因为大一刚入学那半年属实过得有点浑浑噩噩、舒服过头了，所以在寒假自学了 Java 和数据库等知识，企图在弯道超车。当然，回过头来看，也的确证明我当时的所作所为是值得的。\n\n昨天，我在自己的 [知识星球](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247505617&idx=1&sn=73c5e2b1ad9b22d93e8fd6153199ab22&scene=21#wechat_redirect) 里看到一位大一学弟的寒假总结，和我当时的经历非常相似，但又比我强太多了，给大家分享一下，希望能激励一部分还在迷茫的同学。\n\n## 大一学弟的寒假总结\n\n### 前言\n\n这个寒假，我认为自己没有一天懈怠，每天都会花一定的时间去学习。\n\n我是大一零基础入坑的计算机专业，所以比起很多我认识的大佬而言，我的起步是非常低的，也正因如此，在上学期我不敢有一丝一毫的懈怠。我广泛地去学习知识，相比上层形形色色的框架来说，我感觉自己对底层的计算机原理、计算机网络、操作系统以及编译原理更感兴趣。\n\n> 鱼皮：我当时正好反过来，但后来在面试中吃了算法的亏，才意识到基础的重要性。\n\n我的大一上学期过得很精彩，加社团、内卷（手动狗头）、学习，和高中的两个朋友保持联系等。\n\n如果让我用一句话去总结这学期：我不认为我错过了什么，也不认为我的每一步都无可挑剔。但即使有遗憾，我也相信可以重来！\n\n### 寒假前\n\n谁的寒假没有弯道超车的非分之想？\n\n我认为我很贪心，想学 JavaSE、还想学前端三件套、还想学算法和数据结构。。。\n\n虽然我在一开始就应该知道 **贪心不能保证最优解** ，抓住一个方向去专注学习才是正解。但刚开始接触编程知识的海洋，还是很难做到 “专一” 吧。\n\n![](https://pic.yupi.icu/5563/202311051951942.png)\n\n### 寒假期间\n\n#### 学习方面\n\n我大概学了如下知识：\n\n- Java SE 的基础知识过了一遍，但是 IO 流（管道）、内部类、TCP 协议还没学。\n\n- Linux 操作的一部分（其实是自己懒了），基本的文件操作没有问题了，也掌握了 Linux 的整体框架：目录结构、资源管理等。其实我对Linux的第一版的内核还是很感兴趣的，只能在学完 Java SE 的基础后再去学了。\n\n- 数据结构和算法。其实就是读了一下《大话数据结构》，并且图后面的内容还没看，就去写代码练习了。\n\n- 下载并尝试使用 Eclipse、IDEA\n\n- 了解了Java 整体的学习路线\n\n- 加了一个学习圈子 —— 鱼皮的知识星球，我也借此看到了自己的缺点和优势\n\n- - 缺点：我太菜了，Java 只会基础、前端三件套都没学，更别说 Vue / React 框架和 SSM、SpringBoot、SpringCloud 这些框架了\n  - 优点：圈子里面除了极少数的 “妖孽”（手动滑稽）之外都是师兄师姐（师姐目前只见过两个）和已经工作的人了。所以我还有大把的时间去学习，去追赶。\n\n> 鱼皮：扯呢，谁说师姐只有两个？？？（狗头）\n\n此外，在春节期间，我和一位电子通信专业的博士聊天（主要是我向他咨询），我学到了很多的知识（感觉说知识也不太合适，只能说我能从与他的交谈中提前体验到一些经历。这位师兄目前博士即将毕业，并且已经通过了三星的面试，且收到了华为面试通知。\n\n以下是部分聊天内容：\n\n问：谁的大一不迷茫？我虽然大一上学期表现的很云淡风轻的，但是我其实对未来的道路还是很迷茫的。所以我想问师兄：“计算机专业到底是干嘛的？咱们真的是去开发软件吗？每年的毕业生这么多，社会上真的有这么多的缺口吗？”\n\n师兄回答：目前计算机专业还是很有前景的，而且社会上素来都有所谓的末位淘汰制，所以真正有技术的人，一定能吃上计算机的这碗饭。\n\n问：相信大家在考研和工作之间多少有点犹豫，那师兄你认为研究生阶段你的能力有大幅度提升吗？\n\n师兄：并没有。但是我更看好另一种观点：生命对每个人而言都是只有一次，我们为什么要放弃读研这段特殊的经历呢？\n\n问：前端框架、新技术和数据结构算法，到底应该学哪个？\n\n师兄：优先学数据结构和算法，因为算法水平能体现一个人处理问题的水平。将来如果你想进大厂，那么算法是一定会考的。我前段时间面试三星，笔试部分就是让我解一道 ACM 水平的算法题（后面解释说是 ACM 题的变形），我过年之后要去的华为的笔试也是要**手撕算法**（注：这个师兄是电子通信的，不是计算机的）。另外，前端的技术框架虽然我不是很熟悉，但是据我的师弟们说，框架有的只是让你去使用，目前你才大一，时间还很多，主要精力还是放在基础上比较好。\n\n补充一点，校招还是很看重基础的，而社招更看重你做项目的能力。\n\n#### 为人处世\n\n加了鱼皮的知识星球之后，我也深深地被大佬们的实力给折服，所以也开始花费一些时间在认识朋友上了。\n\n上面的那位博士师兄也就人际交往方面给了我很多建议，比如：\n\n- 不能太高冷（手动捂脸哭），感觉我没有啊，可能是我不太懂如何与人沟通吧。\n- 不要把自己放的太高，要和别人有沟通交流。他还举了一个自己的例子，他曾经独立做了一个东西，自认为很完美了，但是在和别人交流之后还是发现了可以进一步完善的地方。\n- 大厂最注重合作了，据说如果在华为的心理测试中，如果你测试的最终结果显示 “你不喜欢团队合作” ，那么无论再优秀也是不会被录用的，因为你不符合他们的企业文化。\n\n#### 感悟\n\n之前的我不能说我是不屑（因为我确实没有这样想），但是我确实不愿意花时间在社交上，因为不知道那样有什么意义。\n\n但是从这个寒假起，我决定要扩大自己的圈子，多多与人为善；持续知识分享：要坚持写题解，做知识记录。\n\n在接触计算机之前我一直都不敢相信竟然有一件事能同时利人利己，不得不感慨：计算机的开源精神是伟大的!\n\n> 鱼皮：以前的我也不愿意和别人交流，总是闭门造羹，因为觉得自己要什么知识都能通过搜索获得，为什么要和别人讨论呢？但直到后来无意间和大佬一起参加竞赛，我才意识到，1 + 1 真的是 > 2，你可以永远相信团队的力量。\n>\n> 但也要注意，要多认识积极乐观 / 优秀的人，好的朋友 / 团队一定是要能互利互助、共同进步，而不是大家一起丧。\n\n### 未来计划\n\n最后也给自己做些计划吧~\n\n#### 总体\n\n- 要将主要精力放在学习和提升编程能力上\n- 提高实战能力，争取暑假去一个中小厂实习\n\n#### 学习\n\n- 先将汇编，编译原理，操作系统，计算机网络放一下（Java SE 里面和 TCP 有关的内容还是要学的）。集中火力打通 Java 一条线。\n- 用 Java 做一个能拿得出手的项目。\n- 每天刷一道 LeetCode 算法题目。\n- 在 2022-07-01 日之前 AK 掉洛谷题单，给自己一点压力。\n\n#### 绩点\n\n- 要好好搞绩点，争取每一科 90+\n- 550+ 过四级\n\n#### 人际交往\n\n- 多多结交大佬（像知识星球里面的大佬等）\n- 在学校里面多多结交朋友\n\n### 结语\n\n如果让我现在去看上学期的自己，我会觉得，那时的整个人虽然很云淡风轻，但是缺乏认知，那是一种无知的表现；如果去看待寒假的自己，那时的自己，很累，每天都很累，每天都会做梦，睡觉质量明显下降，看着众多大佬的牛逼自我介绍 ，我不仅感觉自己很垃圾，想要去追，却还是感觉力不从心。\n\n但现在的自己，因为加入了，看到了知识星球里那么多朋友的真实经历，才帮助我有了更明确的目标，也得到了众多大佬的经验传授。我不会再去做无意义的焦虑，可以踏实地朝目标前行了。\n\n2022 加油！\n\n\n\n------\n\n\n不得不说，才大一就有这种自我驱动 / 自省的意识、执行力以及归纳总结的能力，属实让我感到佩服。毕竟那时的我，也找不到方向，也是啥都学一点儿，直到大二暑假才确认了自己的目标。我也会想，如果我在大一下学期那会儿就通过学长们的经验帮助自己确定了目标的话，结果会不会完全不一样呢？\n\n好了，以上就是我星球内小伙伴的真实经历，如果大家有编程学习 / 求职上的问题要向鱼皮 **1 对 1 提问** 、想看看大佬们的经验分享、需要 **优化简历** 、想认识更多小伙伴，激励自己进步的话，都欢迎加入鱼皮的 [编程知识星球](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247505617&idx=1&sn=73c5e2b1ad9b22d93e8fd6153199ab22&scene=21#wechat_redirect) （点击了解详情）。本周五就开始在星球中直播带大家做项目了~\n\n> 星球刚开张一周，就已经多次霸榜付费星球活跃 **榜首** ！\n\n此外，星球内的资源非常丰富，我最近也在原创 + 整理一些 **保姆级文档** ，希望帮大家更好地进步~\n\n![](https://pic.yupi.icu/5563/202311051951908.png)\n\n> 编程导航星球专属资源\n\n星球原价 **300 元一年** ，现在限时领券 8 折加入只需 **240 一年** ！不确定是否要加入的朋友可以添加鱼皮工作微信 yupi5927（备注 “了解星球”）来咨询。\n\n欢迎 **长按下面的海报扫码领券加入** ，优惠券名额有限，先到先得 ，欢迎和大家一起无限进步！\n\n![](https://pic.yupi.icu/5563/202311051951913.png)"}