{"data": "# 直系学弟进华为啦！\n\n> 本文作者：[程序员鱼皮](https://yuyuanweb.feishu.cn/wiki/Abldw5WkjidySxkKxU2cQdAtnah)\n>\n> 本站地址：[https://codefather.cn](https://codefather.cn)\n\n> 分享直系学弟 “离奇” 的求职经历和心路历程。\n\n大家好，我是鱼皮，今天给大家分享一位 **同校同系** 学弟的亲身经历。\n\n这位学弟自称小透明，就读软件工程专业，即将本科毕业入职华为，职位是 **产品行销经理** 。\n\n他对自己的形容是变化莫测，为啥呢？\n\n因为大四前后短短一年间，他经历了对自己未来规划的各种改变：打算考研 => 打算出国 => 开始找开发岗工作 => 找到一家日企上班 => 辞职，并更改求职方向为产品岗 => 最终上岸大厂。\n\n![](https://pic.yupi.icu/5563/202311070927142.png)学弟一年的经历\n\n回过头来看看这段经历，他自己都觉得挺 **离奇** 的，前后这么短的时间内，竟然还能这么翻来覆去的改变？\n\n当我了解到他的经历后，首先表示佩服，同样深感好奇，他为何放弃考研选择求职？又为何辞职换岗？又如何顺利入职大厂的呢？\n\n所以我立刻就联系了小透明学弟，期望他可以分享自己的故事。在我的一番攻势下，害羞的学弟答应了下来，并且一写就是 6000 字！\n\n![](https://pic.yupi.icu/5563/202311070927808.png)\n\n下面让我们走进他的世界，以一名本科应届生的视角，来看看他的经历和感受吧。\n\n**本文大纲：**\n\n![](https://pic.yupi.icu/5563/202311070927658.png)华为学弟求职分享\n\n## 纠结之路\n\n说句心里话，我对未来规划这种东西，是一种 **突然** 的自我觉悟。而突然的根源，就是前面做的事情导向的 **顺其自然** ，和对自我的一个幡然醒悟。\n\n### 是否考研？\n\n就比如考研这个事儿，我大学本科前三年，都是想着自己要考研的，甚至到了大三下学期暑假的时候，都已经学完了高数。\n\n但是为啥突然不想考了呢？\n\n![](https://pic.yupi.icu/5563/202311070927917.png)\n\n#### 理性分析\n\n先简单说一下我的个人情况吧，我本科前三年想考研的时候，一来没有找到感兴趣的研究方向、二来没有未来职业规划（考博是不可能考博的）。考研这件事儿，貌似还是一个这个年龄这个节点，自己眼里同学眼里父母眼里，很该做的事。所以只是单纯和大部分人一样，想先有个学上罢了。\n\n如果你是想决心做学术，并且对计算机科研深感兴趣的同学，那接下来可以不看了。但是这种人，毕竟是少数。比如我，**只是想混个学历的，而且对科研其实真的不感兴趣** 。其实像这样随波逐流去考研，也不能说是一个坏的选择，毕竟如今的计算机硕士学历还是很值钱的，只要你研究生阶段别太作、简历写的别太烂，通过多数大厂的简历筛选是没有任何问题的。\n\n但是随波逐流闭着眼读研，肯定也不是最好选择。因为第一，研究生的本职工作毕竟是做研究，水一水必然可以，但是计算机专业的特点是薪资高、找工作比较 **内卷** ，就很容易造成：毕业的时候，想从事算法岗位，但科研水平不够、竞争不过博士；做前后端开发，开发经验还不如某些本科生的尴尬局面。第二呢，国内硕士两年半 or 三年时间，还是很长的，人生有多少个三年呢？所以还是应该时刻掂量这个黄金年龄耗费的三年，对于自己是不是最佳选择，毕竟已经不是高考时候死读书的小孩子了。\n\n![](https://pic.yupi.icu/5563/202311070927679.png)\n\n我个人想的是如果工作三年，可能要比读研三年收获要大的多，康康鱼皮学长在腾讯大学读研快一年了，除了技术提升，其他平台也积攒了大量粉丝。读研如果水三年，不知不觉间可能被同龄人甩开太远了。\n\n#### 考虑后果\n\n考研没考上的后果其实是非常严重的，**不亚于高考失利** ！\n\n这是我个人的看法哈，如果考不上，正常情况下，接下来的人生道路有两个选择：\n\n1. 找工作\n2. 准备二战\n\n如果你在考研失败后选择找工作，那么显然，你完美错过了求职的最佳黄金时间 —— 秋招。考研失败，既在校招主战场的秋招 0 收获，又在即将到来的春招面前 0 准备，可谓是非常被动。即使能够找到工作，但只能说如果该同学参加了秋招，凭借他的能力，一定会有更多的选择，可能会找到比现在更好的工作。而第一份工作，对你的人生又是至关重要的。所以同等程度的努力，用在找工作方面的效果可能要比考研更稳定和显著。\n\n如果选择二战，那么首先一定要想清楚，你一战失败的原因是什么。如果想不明白这点，那么二战同样失败的概率是非常非常高的，到时候只会面临一个更尴尬更难受的局面。二战的话首先要面对较大的心理压力，还要再次掂量自己的能力，再给一次机会能不能考过。\n\n所以考研失败后真的是进退两难。现在硕士学历一方面越来越平民化了，另一方面却越来越难考了，毕竟考的人也越来越多了。不知道干啥随波逐流、追求学历选择考研固然没有问题，但还是要想清楚这背后的风险，以及自己是否已做好承担这份风险的准备和觉悟。尤其是计算机专业的研究生真是太难太难考了，报录比太低而且大神多，所以如果决定考研，一定要下十足的决心，做足准备，尽量一次上岸。\n\n![](https://pic.yupi.icu/5563/202311070927257.png)\n\n> 鱼皮：对于是否读研，每位同学都应该像他一样有自己的思考和权衡，而不是被人牵着鼻子走，选择权只能且必须在你自己的手上。\n\n最终，综合考量了一下，我觉得学历还是比较重要，但是除了考研之外就没有其他的提升学历的方式了么？\n\n当然有，出国留学呀！\n\n### 是否出国？\n\n为啥考虑出国留学呢，原因其实也很简单。女朋友要去加拿大留学哈哈，所以我当时一拍脑门：“我要陪着你去！！！”\n\n![](https://pic.yupi.icu/5563/202311070927332.png)\n\n不过后来还是冷静地了解了一下，加拿大申请硕士巨难，我这种垃圾绩点基本不可能。\n\n那不如开始申请英国的水硕试试？\n\n虽然想出国留学，但是我这语言成绩和时间，肯定要 gap 一年。**中介姐姐说，人不能在家赋闲** ，一边工作一边学语言，比在家 “全职” 学语言效果还要好，而且找工作的话工作越好，对申请越有利，最好500强！\n\n（现在觉得：找到 500 强真香！还留什么学？）\n\n好吧那么我的求职之路就正式开始了。\n\n## 求职之路\n\n作为正儿八经的软件工程学子，肯定大家下意识的，都会去找开发方向工作，俗称程序猿。正好，连带着学校的专业实习的课程要求，一起找了。\n\n### 开发求职之路\n\n这个时候大概是刚刚决定放弃考研的 8 月份了，但是很快，我就遇到了一个大问题：看着招聘网站上一个个陌生的岗位，既不知道选什么，又对其所需的技能基本完全不了解。天哪，我们学的是一个计算机吗？！\n\n![](https://pic.yupi.icu/5563/202311070927371.png)\n\n我本科还是参与了一些学科竞赛活动的，都是马上要上班儿的人了，对人家上班干啥都不知道，这不是一个非常恐怖的事情吗？\n\n没错，所以这也就是为什么很多已工作的学长，反复强调 **要早点实习，早点了解工作后要干啥** ，早点知道学校教的专业课都是五十年前的东西找工作一点忙帮不上。这个时候我真的是一头雾水，要一层层捅破窗户纸。在经历了投递后端开发、数据分析、游戏策划、甚至音乐设计之后，终于我的投递开始走向 “正轨” 了……\n\n简单介绍一下我这个时候失败的求职经历吧。失败是必然的，初生小傻子不怕虎，这个时候啥都不会啥也没背的我，也是对互联网大厂产生了很多的憧憬的，并开始了我的简历投递之路。对于研发方向，211 本科的科班学历，足够过掉大部分大厂的简历初筛，进入笔试面试。作为自主招生垃圾的很惭愧的我，因为好歹还有一些算法竞赛的底子，笔试还是过了一些，进入了一些面试。\n\n众所周知，开发岗的面试是要提前准（bei）备（song）的，所以我也简单背了一些。但没想到，我进入面试之后可就太好玩儿了~\n\n考官：“进程和线程的区别是什么？”  我：“...”\n\n考官：“介绍一下数据库索引？”   我：“...”\n\n考官：“TCP / IP 四次握手？”  我：“计网课没选。”\n\n考官：“…… 快速排序时间复杂度总记得了吧？”  我：“logn？2logn？log2n？”\n\n考官：“孩子，加油。”\n\n![](https://pic.yupi.icu/5563/202311070927377.png)\n\n还真就是玩儿，经过了前后一番折腾，大厂的开发岗求职之路不出意外的全部挂掉了。这个时候我选择退而求其次参加了学校安排的专业实习专场面试，拿到了一家日企的正式 offer 并开始了实习。因为面试过程没太有技术环节，所以非常的轻松加愉快。\n\n实习的方向偏重于后端开发，经过三个月的实习，再结合我之前的在校经历与个人兴趣，引起了我对于自己的深（zi）深（wo）思（huai）考（yi）。\n\n### 转职？\n\n以这段实习经历为契机，我开始思考自己到底适不适合做开发。我发现自己有两个很大的问题：\n\n1. 我对技术缺乏热情。\n2. 我进行开发工作的时候，注意力不够集中也坐不太住。\n\n![](https://pic.yupi.icu/5563/202311070927680.png)\n\n我现在还是觉得，开发这项工种，是靠兴趣和天赋驱动的，其实办公室里老天选中的程序猿和其他工种的人一起办公，气场差异真的是有点一目了然的。在开发这个领域，不同的兴趣与天赋带来的效果差异是巨大的。说白了，能不能做开发，要看缘分。\n\n我的舍友（有天赋有兴趣有能力已保研）可以在晚上11点，一边放着蓝牙音箱一边哼着小曲，一边快快乐乐敲代码。而我既无法体会码代码的快乐，又无法体会到支撑无数程序猿精神的 —— 实现某一功能的成就感。这时候可能有人要说了，没有永恒的天赋，只有持之以恒的努力。正是，努力奋（nei）斗（juan）是打工人必须做到与坚持的，**而现在做的，恰恰就是根据个体差异，个人兴趣，选择一个适合自己的赛道与奋斗方向，而不是把努力当借口，不管不顾人云亦云。** 因此在这个非常重要的选择关口，我最终决定还是放弃开发，选择既需要技术，但是技术专业性要求没那么高，同时需要很多组织沟通、设计规划能力的产品方向，作为自己的求职赛道。\n\n> 鱼皮：认真审视自己，勇于突破自身的专业限制，非常值得佩服。\n\n### 产品求职之路\n\n其实一开始，我就是以产品为自己求职的未来导向的，只不过是纠结先做两三年开发，还是直接做产品。这肯定是各有利弊吧，积累一定的技术经验对做产品有很大帮助，但是 **开发思维和产品思维还是有根本差距的** （一个下蛋的、一个孵小鸡的）。再结合上面所写的自己开发肝不动、所以就正式踏上了自己的产品求职之路了吧！\n\n然而现在已经是 2020 年 12 月份了……\n\n![](https://pic.yupi.icu/5563/202311070927913.png)\n\n其实职场的招聘情况是瞬息万变的，但是正好我刚刚作为本科毕业生进行完了校招，所以还敢斗胆再多 bb 两句……\n\n先说说开发方向的面试。从大的方面来讲，开发的面试中注重的是知识的掌握与否，来评估开发水平。一是通过提问，看应聘者知道 or 不知道，知道的话回答的 1 or 0；二是深挖简历中的项目经历或者有没有用过 xxx，来进行进一步的评估。总的来说，**开发方向的面试，包括算法笔试在内，需要准（bei）备（song）的东西比较多，但是效果是肉眼可见的** ，这也是为什么前面反复提到的要 **提前进行准备**，开发面试早点准备（同时早点实习）性价比太高。但是需要注意的是，开发面试的顺利通过，并不代表着实际上手的 “痛苦” 减轻，还是应该结合上一章节内容，对自己能否从事开发之路做一个认真的评估。\n\n产品方向的面试，尤其是校招产品，跟开发还是有着很大的区别。开发的面经想必大家看过很多了，所以今天着重分享一下产品校招技巧。\n\n> 鱼皮：虽然是产品校招技巧分享，但我看完后，感觉很多技巧同样适用于开发岗同学面试，不要跳过这部分内容哦~\n\n### 产品校招技巧\n\n#### 1. 简历初筛\n\n首先是学历关，校招产品经理基本最低最低要求 211 本科，985 本科或者 211 硕士是推荐配置。\n\n道理很简单，开发的话有入行门槛，基本仅限计算机专业学生；但是产品的话虽然计算机专业仍然优先，但是专业放宽了很多很多，这也导致了学历这一块儿出现 **神仙打架** 的局面。比如我在并不算大厂的（虽然现在也真的不小）哈啰产品实习时，组里实习生虽然也有像我这种学历一般的，但是大部分都是比如交大本硕、同济本帝国理硕、华理本宾夕法尼亚硕等等诸如此类画风；而听闻同专业大佬在腾讯实习时，产品组实习僧都是清北藤校之流。\n\n像我最后签的华为，产品经理跟互联网还有区别，在完美错过秋招，通信计算机专业优先的情况下，学历放宽到了 211，最后才能跟着一堆 985 硕一起入职，还是很荣幸的......\n\n![](https://pic.yupi.icu/5563/202311070927910.png)\n\n另外产品方向的简历，超级简历那种白纸模板写满一页纸是基本要求吧，具体内容会在下一节展开说明。\n\n> 鱼皮：我认识一些本科求职产品岗的同学，据他们反映，校招产品岗真的是神仙打架，学历较低的话真的需要慎重！当然，趁早开始多几份实习经历也有机会。\n\n#### 2. 前期能力积累\n\n与开发的强应试面试不同，产品面试不仅需要针对性应试准备，也需要长久的能力积累，这一点和英语口语很像 —— 无法突击。因为产品面试，尤其是校招面试，不像有工作社招一样会有历史产出可以问，而校招本身就是更看重个人综合素质、未来发展的潜力等等，因此我参与的 n 场产品面试，**都是以聊天式为主，不太涉及专业技术细节** 。这种面试形式决定了面试既简单 —— 不太会出现像开发面试那种不知道的情况，又很难 —— 不同人的面试表现真的差距太大太大。而且面试官本身就是老油条，有各种 “丰富多彩” 的形式和你聊天，比如灵魂提问、性格探讨、压力注入等等，总之目的只有一个，**通过变着花样玩你，来打破你虚伪的突击准备，从而揭开你的真实面目。**\n\n![](https://pic.yupi.icu/5563/202311070927778.png)\n\n因此前期的、持之以恒的能力积累是必须的，推荐几种提升自己的方法：\n\n1. 实习：一定实习，尽早实习。大二大三、暑假寒假，与其闲着，不如实习。大厂难进，先去小厂，迂回实习。\n2. 竞赛：对产品有帮助的竞赛有很多，而且这一部分其实非常重要，但是大家比较容易忽视。比如挑战杯、三创赛等等，数学建模等等，因为它可以在一件具体的事情中（而不是像学生会的多数自娱自乐），锻炼你与队友为了达到一个目的，而进行组织沟通的能力，这个对于整个沟通能力与可行性分析能力的提升帮助是巨大的。\n3. 商赛 or 精英营：对于尤其是非理工科类的专业学生，这方面的帮助是非常大的，比如一些商赛挑战赛、pwc 的暑期精英营等等。\n4. 学生组织。很多人刚上大学总是会习惯性的加入一个学生组织，但是现在回过头看，大部分的学生组织经历，其实不会有太大锻炼效果（尤其是院级的组织），或者说跟前面所说的竞赛、实习一比，锻炼效果相差甚远。但是我个人的话，是真实得到了锻炼的，因为我在加入校合唱团担任男低音声部首席的时候，**独立承担声部加排了一百次左右** ，并且随团去过匈牙利、俄罗斯进行了比赛、拿了金奖。所以学生组织这个东西，差异性很大，随机性很强，一定一定要衡量自己正在进行的学生组织活动，是否值得你花时间精力，或者你是否真正感兴趣，以及尽量搞出一些 “名堂”。\n\n> 鱼皮：我在大学期间也在学生会工作了两年，亲测可以提升你的组织、管理、表达能力，但切忌要控制好投入的时间。\n\n#### 3. 针对性的突击\n\n校招产品看重日常的积累，那么短期突击有没有用呢？当然有用！\n\n![](https://pic.yupi.icu/5563/202311070927660.png)\n\n下面几种方法虽然不能让你有长期能力的提升，但是对于某一单场面试，甚至可能是决定结果的胜负手。\n\n1. 资料收集。活学活用互联网，全方位的了解你要入职的公司、部门岗位从事什么业务。百度、Google、牛客、力扣、脉脉、知乎、甚至贴吧微博...\n2. 针对性出击。举我自己的一个例子非常好理解：在我华为面试期间，正好正在举行MWCS世界移动大会，其中华为正是作为主会方之一。我完整收看了大会的华为演讲部分，并进行了笔记整理，事实上最终这对我的面试起到了非常大的帮助。前面说过面试官会想方设法打破你的虚伪突击准备，但是一些对待面试的有针对性的认真准备，反而势必会让面试官感受到你的认真态度。\n3. 态度传达。我个人认为这是面试中十分重要的一点，在面试当中一定要表现出自己对通过面试的强烈渴望，至少你要透传给对面老师一种，你并不是无所谓，而是想通过本次答辩或者面试的态度。毕竟只有短短几十分钟，面试官也都是有感情的人，这可能直接影响着最终的面试结果。\n4. 适当多说。俗话说一语千金，但是事实上，能说却少说，和不能说，相差了两个境界的level。在短短面试几十分钟，我们还是尽量多说。但是需要注意语速不要太快，不要抢别人话说。\n5. 简历 / 自我介绍微调。一招走天下固然好，但是应该适当地根据单位不同、职位不同、业务线不同，进行相关微调，突出自己在不同业务情景下的特长特色。比如这个公司是卖烤地瓜的，你应该突出自己食品行业相关经历特长，而不是突出宣扬自己擅长修自行车。\n\n求职经历分享结束，之前鱼皮写过一篇文章来分析大学生是选择 ACM 竞赛还是开发：[学妹问，学网站开发还是打 ACM？](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247497901&idx=1&sn=675bd734742e8fee1c405d4dd22a2e5c&chksm=e9c21f5adeb5964c0919d0ebcf4aba114435227119953c6a65502d26f010ebbc3ef6d821d8c3&scene=21#wechat_redirect)\n\n正好，这位学弟是参加过 ACM 集训队的，来听听他的看法吧~\n\n## 附：为啥说本科 ACM 是神坑勿入？\n\n个人高中划了划水来东华自招，以普通人的视角，觉得算法竞赛这东西主要特征有两点：\n\n1. 多投一点时间就能再强一点，所以最好的备赛方法就是投入所有的时间。\n2. 但是再投入时间再多也永远天外有天，永远被神碾压。\n\n![](https://pic.yupi.icu/5563/202311070927074.png)\n\n算法竞赛本身核心是数学，虽然和开发一样都是码代码，但是本质天差地别，一个是相对动手偏实践，一个是相对动脑偏思考。竞赛厉害往往两种人，要么学得早学得多，要么真的聪明。各大 985 高校从高中或初中就开始学算法竞赛的 noi 或国家队选手，往往又学得早又聪明，在赛场上秀得头皮发麻，因为本质是数学，所以跟应用比赛、创业大赛不同，弱校不太存在拿大奖可能。即使你真的高考没考好又数学天赋极强，不要忘了你还有两名队友……\n\n当然能带队 carry 的大佬也是有的吧，比如东华，300 个人里 30 个人能选拔进集训队，10 个队伍里有两三个获奖，两三个奖中一个或者没有银奖，至于金奖要追溯到 2006 年…… 所以最好还是不要赌自己就是那个天选之子，是不是真的不好说，没学过的话，还是看天赋这个自己也不清楚有没有的东西。\n\n所以如果以功利视角（相信大部分人还是功利的），有点兴趣也不是那么大的话，选择搞项目 + 去实习 + 弄作品竞赛一键三连，性价比真的是高太太太多了，毕竟如果搞算法竞赛不深入的话只是半瓶子醋浪费时间，搞别的比赛或者实习却是一定有收获。笔试面试中的数据结构算法考察是过关性考试，刷 LeetCode 就行，而 ACM 却是一个是现场即时排行的实打实的竞赛。\n\n**努力是刚需，但是不要忘记努力之前的选择更关键。**\n\n![](https://pic.yupi.icu/5563/202311070927040.png)\n\n\n\n------\n\n\n看到这里，不知道大家有何感想。\n\n最让我深有感触的是：小透明学弟在不断抉择和尝试之后，终于明确了自己想要什么，并且勇于打破常规、另辟蹊径，踏上了自己坚信的道路，义无反顾的走了下去。\n\n也许开始会迷茫，但是不是可以通过提前参与，让自己的未来逐渐清晰呢？还在编程一条路上走到黑的同学，是不是也可以思考更多的可能性呢？\n\n最后，这位学弟还放出了我们多年之前的聊天记录，原来他在刚高考完就联系到我了，我自己都快忘了哈哈，果然没有看错人！\n\n![](https://pic.yupi.icu/5563/202311070927475.png)\n\n![](https://pic.yupi.icu/5563/202311070927622.png)\n\n![](https://pic.yupi.icu/5563/202311070927930.png)\n\n好啦，以上就是本期分享，觉得不错的话，还请朋友们 **点赞 + 在看** 支持下，希望能帮助到更多同学 ❤️\n\n![](https://pic.yupi.icu/5563/202311070927325.png)"}