{"data": "# 实习天天crud，很迷茫...\n\n> 本文作者：[程序员鱼皮](https://yuyuanweb.feishu.cn/wiki/Abldw5WkjidySxkKxU2cQdAtnah)\n>\n> 本站地址：[https://codefather.cn](https://codefather.cn)\n\n大家好，我是鱼皮。\n\n先问大家一个问题：大家在实习的时候，都会被安排怎样的工作呢？是打杂的边缘工作？还是会被分配比较核心的业务？如果被分配打杂工作，又如何争取更好的工作内容呢？\n\n我昨天在 [编程导航](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247544329&idx=1&sn=8c268a0a40befcc2b470c75ced1cb1d6&chksm=e9c2c9fedeb540e848aa18c484a9674dc9dd28fc45bb510dc4be52b147dd4c1d8fd7fe6899df&token=1562751299&lang=zh_CN&scene=21#wechat_redirect) 回答了一个类似的问题，给大家一些参考：\n\n## 问题：\n\n鱼皮，您好，关于实习经历我有些困惑想询问您 。\n\n我想知道面试官究竟想从求职者的实习经历看出什么，我个人对于实习的理解是否正确？\n\n我个人对于实习的理解：\n\n因为就我个人对实习的了解，大多数实习都是打杂和 crud，没什么真正有难度的业务给你做，即使有也不放心交给你，实质上求职者在实习当中没有解决过什么有难度的问题，很难在实习经历中写出什么有含金量的内容。\n\n大多数实习生都是通过自己看懂公司系统有难度的业务然后将其写在简历上，但是这样会对业务缺乏真正的理解，因为根本不是自己动手实践解决的问题，面试官一旦问深一点就很容易被识破了。\n\n即使是遇到有难度，有含金量的业务，分给了你 leader 和你共同完成，实际上大多数有难度的部分都是你 leader 一个人完成的，但实习生为了有东西可以写上简历，就会在实习经历中说成是自己完成的，我感觉这样同样很容易被面试官识破，只要面试官沿着业务问深一点，很多问题始终不是自己来解决的，终究会答不出来。\n\n以上实习的理解其实并非我一家之言，我在星球看到了不少人有这样的疑惑，同时我自己认识的一些同样普遍反映出实习学不到什么东西的反馈，当然因为的视角局限，很多同学都是在中小型公司实习的，至于中大型公司的情况也许会有所不同，但是我想知道在中小型公司实习如何破局？在实习经历中稍微能写出一些能吸引面试官的经历，最起码做到不能因为这段实习经历减分。\n\n## 鱼皮回答：\n\n你说的是大多数实习的现状，因为实习生本来会的就不多、经验又少，当然不会给你安排很复杂的工作、很有挑战的项目（除非是把实习生当苦力）。\n\n如果你在抱怨自己的实习公司不好、抱怨自己实习期间学不到东西，不妨先问自己几个问题：\n\n1）简单的工作，你能做到最好么？有做到让上级满意么？\n\n2）有想过主动去学习公司的其他业务？主动承担工作么？\n\n3）有想过利用公司的资源来提升自己么？\n\n4）有把自己的想法和导师 / 上级反馈过么？\n\n5）自己的工作态度足够认真么，还是眼高手低，看不上这份工作？\n\n比如你和导师被分配一起完成有含金量的任务，你有主动找导师交流过，说想参与业务的设计或部分代码的实现么？为什么你导师解决过的问题，你不能把这个解决方案学会呢？\n\n记住，在公司实习的成长不是只靠公司单方面给予的，而是需要【自己去争取】的。总会有一些优秀的同学，能够在实习前期很快地完成 Leader 分配的简单工作，然后主动去接更多的工作、主动去学习业务和源码、主动去提出优化项目的想法和建议，给自己争取到更多的成长。\n\n说几个我自己在腾讯实习期间自认为表现好的几个点，也是我自己争取的机会，给大家参考： \n\n1）主动参与公司内部的开源项目，成功贡献了代码\n\n2）在导师繁忙的时候主动帮他分担工作\n\n3）主动参与导师的晋级答辩会议旁听，提前学到了不少答辩技巧和系统设计方案\n\n4）积极熟悉公司内部的各种基础技术建设，并且整理了笔记，供组内其他同学学习\n\n5）积极参与公司内部的各种分享会，不满足于自己的业务，拓宽业务边界\n\n6）主动在组内通过会议的形式给大家分享了区块链技术\n\n（下面的截图也是我实习转正申请文档的一部分，列举了一些我在实习期主动去做的工作，并没有人给我安排去做这件事情）\n\n![](https://pic.yupi.icu/5563/202311070838648.png)\n\n再拿我自己带的实习生来说，线上实习期间，每个工作都完成的很好，而且把项目文档写得也非常完善，超出我的预期！所以不到一个月，我就把几个核心的项目源码都给他学习了，也能很快掌握。现在他已经成为了我这几个项目的核心负责人，帮我节省了很多的时间，自己也得到了飞速的成长，所以我也向他抛出了正式 offer 的橄榄枝。\n\nOK，如果你问了自己上述几个问题，也尝试过争取机会但是无果，那么也没什么好遗憾的，你得继续努力自学，**哪怕是摸鱼也要抽时间自学**，尽快去更好的公司。\n\n\n\n\n\n------\n\n\n欢迎学编程的朋友们加入鱼皮的 [编程导航](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247544329&idx=1&sn=8c268a0a40befcc2b470c75ced1cb1d6&chksm=e9c2c9fedeb540e848aa18c484a9674dc9dd28fc45bb510dc4be52b147dd4c1d8fd7fe6899df&token=1562751299&lang=zh_CN&scene=21#wechat_redirect) ，和 2 万多名编程学习者共享知识、交流进步，学习鱼皮全程直播开发的原创项目、上千篇优质编程学习求职经验分享、并获取 1 对 1 答疑指导服务。"}