{"data": "# 面了个Java实习生，小伙很优秀！\n\n> 本文作者：[程序员鱼皮](https://yuyuanweb.feishu.cn/wiki/Abldw5WkjidySxkKxU2cQdAtnah)\n>\n> 本站地址：[https://codefather.cn](https://codefather.cn)\n\n大家好，我是鱼皮，前几天给自己的公司面试了一位 Java 暑期实习生，候选人目前是大三。\n\n整个过程我都录屏了，并且在征得候选人的同意后，把面试过程分享出来。一方面是希望对其他在学编程找工作的小伙伴有一些启发和参考，另一方面也是希望大家给屑老板一些建议，让我也能成为一个更好的面试官。\n\n![](https://pic.yupi.icu/5563/202311041302600.png)\n\n以下是面试过程视频，整个面试时长大概 40 分钟，我精简了一些内容，但依然有点儿长，大家可以先收藏起来慢慢看~\n\n虽然很多朋友参与过面试，但是应该很少有作为面试官去面试别人的经验，下面我就给大家简单分享下我作为面试官的心路历程。\n\n首先，由于我也是第一次这么正经地作为面试官，所以其实也是有点儿小紧张的。\n\n> 希望大家面试也不要紧张，可能面试官比你还紧张哈哈，就当和面试官交流技术了~\n\n大家信任我，来投递我这么一家小公司，又满怀期待地参与面试，我必须得积极回应下对吧！所以我的想法是：通过这场面试，哪怕最终这位候选人的表现没有符合我们的要求，也要让他能学到一些东西，对他之后的学习有一些正向的影响。\n\n因此，和我自己经历过的大多数面试不同，除了按照候选人的简历从上到下依次提问外，我基本上每问一个问题，都会解释一下我为什么要问这个问题，让候选人 get 到面试官的思路。此外，如果候选人不能很好地回答问题，我会给他一些小的引导（比如举个例子之类的），并且在他回答完后分享一下我想听到的答案。\n\n结果，这位小伙子整个面试的表现都非常不错，最终被我们录取了~\n\n让我印象比较深刻的加分项有几点：\n\n1. 听完问题后再作答，而不是着急抢答，每个问题的回答时长也恰到好处\n2. 语言表达自然，虽然还是有点儿紧张（正常），但回答问题时的思路还是很清晰的\n3. 项目实践能力非常丰富，完全符合我们的工作需要\n\n目前这位小伙也已经在我司工作一周了，不仅工作态度认真、上手工作快、文档写得好，甚至还能够超出预期完成任务，针对一个问题提出多种不同的解决方案等。等他放假来线下了，必须加餐！\n\n以下是这位小伙伴入职后在 [编程导航星球](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247539132&idx=2&sn=45af016dee0c03491750f76ba8fdbd25&chksm=e9c2be4bdeb5375d3253155b4053263109a631620b7cb9074e2fe1b4a5b1604ef92c522b606e&token=292259508&lang=zh_CN&scene=21#wechat_redirect) 内的发的一个面经，得到了候选人的肯定，屑老板还是挺开心的哈哈（我可没绑架他）！\n\n![](https://pic.yupi.icu/5563/202311041302710.png)\n\n> 星球原帖：https://t.zsxq.com/0e1PImfyg\n\n还有很多小伙伴问我还招不招人？\n\n至少我目前没有招新人的打算。因为招人本身不是一件随意的事，用工成本、管理成本、信任成本都要考虑。而且说实话，大家对我的期待有点太高了，我也是第一次开公司，而且也是个创业小公司，我每走一步都需要很谨慎。\n\n所以大家如果对我、对我们公司有什么好的建议呀，都欢迎指正。如果屑老板真的做大做强了，肯定还会招人滴！感谢阅读（忘开留言了，难受）\n\n\n\n------\n\n\n欢迎学编程的朋友们加入鱼皮的 [编程知识星球](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247539132&idx=2&sn=45af016dee0c03491750f76ba8fdbd25&chksm=e9c2be4bdeb5375d3253155b4053263109a631620b7cb9074e2fe1b4a5b1604ef92c522b606e&token=292259508&lang=zh_CN&scene=21#wechat_redirect) ，和上万名学编程的同学共享知识、交流进步，学习原创项目并享有答疑指导服务。"}