{"data": "# 毕业这年，我成为了一名 UP 主\n\n> 本文作者：[程序员鱼皮](https://yuyuanweb.feishu.cn/wiki/Abldw5WkjidySxkKxU2cQdAtnah)\n>\n> 本站地址：[https://codefather.cn](https://codefather.cn)\n\n大家好，我是鱼皮，一位编程爱好者和分享者，致力用最有趣通俗的方式帮助大家学习编程知识。\n\n目前刚刚毕业半年，正在鹅厂做应用开发。下面想和大家分享我过去一年的经历和心路历程，希望能对大家有些帮助。\n\n过去一年，我做了。。。\n\n### 远程实习\n\n去年二月，由于疫情，我被困在家里，无法返回学校，也无法回公司继续实习，于是就开始了远程实习工作。本来以为远程实习是一件非常轻松的事情，但没想到刚开工那几天，基本都是零点后才能结束工作，待在家里反而为加班提供了地利。但正是短短的这几天，我在导师的帮助下完成了一个高并发系统，技术能力得到了快速提升。\n\n我把整个系统的设计和开发的完整过程写成了一篇万字长文，[一周上线百万级高并发系统小记](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247484844&idx=1&sn=d9645a20b905feb6589acc68b4a1b7e3&chksm=e9c1e25bdeb66b4d5a8f5999786df8bbd32e039523a2920016bc557ae5f2c9944f63dd7f8cd8&token=1212922013&lang=zh_CN&scene=21#wechat_redirect)。\n\n![](https://pic.yupi.icu/5563/202311031337079.png)\n\n没想到在牛客网还小小的火了一下，当时内心还是挺有成就感的。\n\n### 抖音创作\n\n后来有一天，不是很忙，我就打开了春节时为了红包而下载的抖音。随便翻了几个视频后，我发现好像在抖音，并没有多少做技术分享的程序员，或许是因为抖音偏娱乐向；又或许是因为短视频的限制，很难通过只言片语讲清一个技术。\n\n我是一个比较喜欢尝试新事物的人，正好录制短视频的成本也并不会很高，于是我就在工作之余开始了自己的短视频制作生涯。\n\n由于我在大学期间做过一个面试刷题系统【面试君主】，因此第一个抖音短视频账号就叫 “面试君主”，视频内容专注于程序员高频面试题解析。\n\n![](https://pic.yupi.icu/5563/202311031337559.png)\n\n> 面试君主 APP\n\n真正做短视频后，我才发现事情并没有自己想象的那么简单。\n\n首先是制作成本，做短视频并不只是简简单单用手机拍摄一下、录个屏就完事了，除了选题和最基本的内容外，很多的素材都需要精雕细琢，比如封面、标题、标签、第一眼、开头等。我会先写稿子、打磨和验证内容，然后再录像，结果第一期视频就做了三四个小时。\n\n功夫不负有心人啊！猜猜最后的播放量是多少？\n\n我记得很清楚，一天下来，播放量是整整 18！\n\n我想过新人播放量会比较低，但没想到这么特么低！说不难受是不可能的，但毕竟是第一个视频，而且我当时的目的很纯粹，就是通过分享，**在帮助大家的同时巩固自己的知识**。因此，我没有放弃，又一连坚持了大概一个月，每天至少更新一个视频，周末还会更新三个视频！\n\n虽然每个视频的播放量也只有几十，但是一个多月的坚持，也让我收获了**人生中第一批粉丝**，大概有 100 多个，其中几十个还是我的朋友。最高播放量的一个视频达到了 1800，所以我很喜欢 18 这个数字，他对我很有意义。\n\n![](https://pic.yupi.icu/5563/202311031337879.png)\n\n> 面试题短视频分享\n\n后来有一天，我静下心来思考，这样的坚持是否还具有意义。于是我去看了很多其他同学的视频，发现往往真实的故事最能打动人，于是，我又注册了一个新的抖音号，也是现在的号【程序员鱼皮】，并且第一次通过短视频平台将我的编程学习和求职经历分享给大家。\n\n结果，这次的播放量和点赞量出乎我的意料，第二天醒来，消息已经 99+，当时的心情还是非常激动的。\n\n![](https://pic.yupi.icu/5563/202311031337553.jpeg)\n\n但是，当我打开评论区，心情立刻就跌入低谷。评论区充斥着各种各样的 **怀疑、鄙视、甚至是谩骂**。\n\n![](https://pic.yupi.icu/5563/202311031337632.jpeg)\n\n![](https://pic.yupi.icu/5563/202311031337660.png)\n\n![](https://pic.yupi.icu/5563/202311031337771.jpeg)\n\n很多人说 “又一个营销号” 诞生了，但当时，由于我对创作平台的了解并不充分，甚至都不知道什么是营销号！后来随着对抖音的了解，我才发现，这个平台上的营销号真的太多了，几十万粉的那些编程大号，清一色的培训机构，所有的视频风格都完全一致！比如：程序员如何关机的，安排！\n\n![](https://pic.yupi.icu/5563/202311031337508.jpeg)\n\n好吧，我算是知道这个视频为什么能火了！虽然都是差评，但这**互动率**是真的高。\n\n记得当时有一个骂我的评论点赞数还巨高，都快接近我当时的视频点赞数了，我当时的心理素质不够强，就删掉了评论。现在想想，真的要感谢当时骂我的朋友们。\n\n这条视频过后，我开始思考，如果要分享编程技术，也可以换一种更有趣、更迎合大众、更容易被接受的方式。创作当然可以只顾着自己爽，但是如果能让观众也爽了，岂不是一举两得？\n\n于是，我开始分享一些优质的、易用的编程资源，以及一些自己积累的编程小知识。并在这个期间不断地学习短视频创作技巧，学会看数据，学会优化各项指标，多看他人的视频来学习好的创意和经验。\n\n此外，我尝试了人生中第一次直播，画面是一台电脑，记得当时大概有十几位观众，**我不知道该讲啥，也不知道这十几位观众在看啥**，我就一直在重复 “大家好，这是我第一次直播”。后来，我坚持每晚直播一小会儿，通过在直播间和大家交流编程，我感受到了多样人生，和粉丝朋友们保持了良性互动，也帮助我收获了更多的粉丝。\n\n通过不懈的努力，我的抖音渐渐有了起色，粉丝数和播放量都稳定增长。虽然说抖音是一个偏娱乐和生活的平台，但是我在这里也拥有了一片属于自己的小天地，认识到了很多的朋友。\n\n坚持也让我看到了另一个变化，就是评论区底下对我的怀疑和谩骂变得越来越少，甚至到现在，视频底下基本不会再出现差评了。这让我又开心又难过，开心的是，自己一直在坚持的事情帮助到了更多同学、得到了肯定；难过的是，没人骂我后，评论区的互动率着实降低了很多（开个玩笑哈哈）。\n\n![](https://pic.yupi.icu/5563/202311031337680.png)\n\n> 我的短视频分享\n\n截止到目前，我开设了几个合集，粉丝数也达到了 **7.8w**，这个粉丝量虽然在整个抖音平台可以说是非常非常之低了，但是在编程技术分享这一块，应该也是一个不错的成绩。\n\n![](https://pic.yupi.icu/5563/202311031337959.png)\n\n> 抖音合集\n\n### 毕业设计\n\n在去年 5 月份，我向公司申请了一个半月的假期，在家专心完成自己的毕业设计和论文。有趣的是，明明大学期间我主攻前端和 Java 后台开发技术，也学过一些大数据和区块链的知识，但毕业设计却用 C++ 做了一个图像处理的软件！\n\n![](https://pic.yupi.icu/5563/202311031337971.png)\n\n> 显微图像聚焦识别\n\n### 个人项目\n\n准备好毕业材料后，我决定独立开发一个小程序，小程序的主题依然是【面试君主】，提供一个在线刷面试题、帮助程序员通过面试的平台。\n\n我每天投入 4 个小时左右进行开发，在一个月后，终于大功告成，支持题目的增删改查、标签、语音录题、相似题识别、消息推送、滑动切题、自动推荐、试卷生成等，并且用数据抓取等技术积攒了第一批题库。\n\n![](https://pic.yupi.icu/5563/202311031337990.jpeg)小程序主界面\n\n![](https://pic.yupi.icu/5563/202311031337139.png)添加题目\n\n![](https://pic.yupi.icu/5563/202311031337784.png)标签管理\n\n让我非常遗憾的是，没有流量去推广这个小程序。而且后面正式工作之后，我实在是没有时间维护它了。后面我会分享这个小程序的设计和实现过程，让它给大家带来一些帮助，也算我的努力没有白费吧。\n\n有兴趣的同学可以体验下：\n\n[面试君主小程序](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247492957&idx=1&sn=ad214bddcfa79ea3f08cb34941adeed6&scene=21)\n\n### 阅读\n\n在正式工作前，我利用在学校最后的时光，抽时间阅读了几本书。由于我本身是全栈方向，学的技术比较广泛。所以我选择三本书，分别是前端工程化相关、后端云原生相关和大数据实时数据流系统相关的书，读完这几本书后，我变秃了，也变强了。\n\n![](https://pic.yupi.icu/5563/202311031337111.jpeg)\n\n### 转正\n\n拿到毕业证后，开始了我的职场生活。鹅厂的毕业生是有几个月的试用期的，因此，在这期间，我每天都非常拼命地工作，短视频也停更了。由于我已经在鹅厂实习了一年了，在这期间也给公司的开源项目、Apache 开源项目做过贡献，所以转正过程也比较顺利。\n\n### 写文章\n\n从大学起，我就有写文章的习惯。我会经常记录学到的知识，加上自己的理解，然后整理成文发到自己搭建的博客上。\n\n在工作中，我依然保持这个习惯，会将业务中用到的技术，以及自己学到的知识在公司内部进行分享。\n\n后来有一天，我的博客过期了，没地方分享文章是很难受的！于是，我就开设了自己的公众号【程序员鱼皮】，在这里分享自己的编程技术文章。\n\n顶着工作的压力，肝出来的原创文章并不多，但得到了很多前端、后端等方向技术大牛的认可，也被 CSDN、菜鸟教程、51 CTO 等平台多次转载。\n\n比如下面几篇硬核文章：\n\n[大厂机密！30 个提升团队研发效能的锦囊](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247487157&idx=1&sn=8c0d05d93ae84ca3051723f6af42e7f5&chksm=e9c1e942deb66054d1f6480a30455354371c8f06658f9f8052f6696a1a8ccb43377405579c32&scene=21#wechat_redirect)\n\n[揭秘软件开发的达摩克利斯之剑](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247489788&idx=1&sn=37e845a069310e4ec8ab4521b3cd5f73&chksm=e9c1ff0bdeb6761d40f39e4743488dead5d6dab7707e6e39fba49a8e5f47e2b3bff28e1c17f4&scene=21#wechat_redirect)\n\n[小记 | 从 0 到 1，看我玩弄千万日志于股掌](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247485369&idx=1&sn=d125e78d175e38684e92cceee7e09b16&chksm=e9c1e04edeb6695867e1428bdee5dc9404e223a811372cb0330fabcb3acf9d3f59054e438e07&scene=21#wechat_redirect)\n\n由于我是全栈方向，所以原创不限于前端或后端，更多的是编程经验、通用技术，以及一些能提升大家编程兴趣的项目实战。比如：\n\n[奇思妙想，动手 DIY 你的浏览器主页](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247492012&idx=1&sn=354f78f0d16545ba76f879251a112057&chksm=e9c2065bdeb58f4d6356d8c51067586a98356ed396bbbd49a2807f09d87ff2914930062cc8b6&scene=21#wechat_redirect)\n\n[腾讯公测云开发低码！全网首篇实战评测](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247491816&idx=1&sn=608580ffbba8de53e1c4181120d37d0f&chksm=e9c2071fdeb58e09559035d0d1dd2ce93f99d0e745655010958b88c51a9da1b61cf8dbcca164&scene=21#wechat_redirect)\n\n[实战 | 尝鲜 Svelte 前端框架，开发读书笔记](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247486075&idx=1&sn=848b89c5adff0e8aa429cae6827aafc2&chksm=e9c1ed8cdeb6649a4d473acf655036768d6f39e20d50ea604cb927c5d457a26d86f7b3843308&scene=21#wechat_redirect)\n\n[实战 | 一不小心创造了新的编程语言！](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247485632&idx=1&sn=64567622d099351c3c890e9ba22ea63f&chksm=e9c1ef37deb666210f28fa02239e0bee87eaa33fd6c021f051f2bd04472dbce3c0d2f7aacfcf&scene=21#wechat_redirect)\n\n通过一段时间的运营，公众号的粉丝也达到了 18000+，感谢大家的支持！后面我会持续更新。并且再等一段时间的技术沉淀后，我也会开设自己的原创系列文章和专栏。\n\n![](https://pic.yupi.icu/5563/202311031337550.png)\n\n### 落户\n\n就在不久前，我拿到了属于自己的上海户口。上海是个我非常喜欢的城市，我也是早在大二就开始计划积分落户了。并且在后面自己开发了一个【上海落户积分计算器】来帮助自己和小伙伴们对落户有一个更清晰的了解，便于提前做规划。\n\n作为本科生，即使成绩非常优异，没有竞赛或专利也是很难落户的。意识到这点后，我是在大三时参加了挑战杯并有幸拿到了国奖，然后毕业前努力争取到了上海市优秀毕业生，才得到了这个落户机会。\n\n我将落户的经验也写成了文章，分享给大家，[落户上海！分享心得，再做个积分计算器](http://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247490632&idx=1&sn=b969b53f568055a5e4e112c80bb2a978&chksm=e9c1fbbfdeb672a944d57d6eb2cd1ca678215704f1373570f4a985145a4c7b696dfc3e84a0e8&scene=21#wechat_redirect)。\n\n![](https://pic.yupi.icu/5563/202311031337314.png)\n\n> 某竞赛现场\n\n### 编程导航\n\n在工作之后，想要做自己的事情就真的太难了。\n\n顶着大厂工作的压力，我花了一个月的时间独立开发了【编程导航】网站，帮助大家发现优质编程学习资源。\n\n在这个网站，你可以检索自己需要的资源、分享好的资源，并对他人推荐的资源进行评价。好的资源会因此被更多人发现，从而帮助大家学习编程。\n\n![](https://pic.yupi.icu/5563/202311031337050.png)\n\n> 编程导航\n\n### B 站创作\n\n就在上个月，我决定正式在 B 站发布视频，第一条视频和抖音一样，都是分享一下自己的学习经历。虽然有一点点标题党，但内容真实干货，也有幸得到了不错的播放量，收获了很多小伙伴的关注。\n\n在真人出境这一块，我还是有些不自然，有小伙伴发现我还是个歪嘴战神，还要继续练习呀！\n\n![](https://pic.yupi.icu/5563/202311031337354.png)\n\n由于平时工作比较忙，视频很多都是周末和平时熬夜做出来的，但还是会坚持给大家分享实用的编程资源和技术干货！"}