{"data": "# 休假结束，定个新目标！\n\n> 本文作者：[程序员鱼皮](https://yuyuanweb.feishu.cn/wiki/Abldw5WkjidySxkKxU2cQdAtnah)\n>\n> 本站地址：[https://codefather.cn](https://codefather.cn)\n\n大家好，我是鱼皮。时间过得真快，一转眼，我长达 17 天的假期竟然只剩下最后一天了！必须要告别在家混吃混喝的日子了。\n\n![](https://pic.yupi.icu/5563/202311041340262.png)\n\n临行前，给大家分享一下这个假期中让我比较有感触的事情：\n\n#### 1. 爱惜书本\n\n大学时期每次假期我都会带很多书回家，每次都读不完。然而今年就带了一本工具书《软件开发的 201 个原则》回家，结果直到现在，我都没有把这本书从包里翻出来！\n\n我当时的想法是就算没读书，也能拿它当鼠标垫，然而万万没想到，我回到家之后，鼠标也没有用过。。。\n\n太真实了！\n\n#### 2. 家人\n\n放假回家前，我就告诉自己，无论再忙，都要多陪家人和朋友。所以在大年初一那天，我特意买了一张我们县城的电影票，带我妈一起去看电影《水门桥》。\n\n到了电影院，我妈说了一句话：“长那么大，第一次来这种电影院。”\n\n说实话，我当时心里挺不是滋味的。我家是在小县城下的某个屯子，平时只有一个给职工放票的电影院，不仅观影体验一般，而且关键是每次我们都只能混进去看。。。\n\n“没事，以后多来！”\n\n现在自己有能力了，当然希望让爸妈过上更好的日子，带他们体验更多新事物。\n\n#### 3. 朋友\n\n回家后，很多天晚上我都会出去和老同学们玩耍，打打桌游、打打乒乓球之类的。不得不说，感觉熬夜多了后，无论是脑力还是体力，都大打折扣了。\n\n最让我难过的是，在毕业之后，一年年的，能聚在一起的朋友越来越少了。我大学那会儿还能约够十来个人打打狼人杀，如今桌游能约到 6 人局就已经是奇迹了，甚至有一天晚上我和两个朋友沦落到只能在线下一起打线上斗地主。。。\n\n忙，都忙，忙点儿好啊。\n\n真是羡慕学生时代，那种随叫随到、霸店打桌游的日子。\n\n#### 4. 闲\n\n从踏进家门、感受到温暖的那一刻，我就意识到，给假期定的计划是铁定完不成了。\n\n假期这些天，我每天办公时间不超过 6 小时（平时上班时间还 8 小时呢），而且效率奇低（梦回上课开小差的年代），总共只更新了 2 期视频，再加上给自己的网站做了些简单的优化、筹备了自己的知识星球等。\n\n所以我不禁感慨，真的是生于忧患死于安乐。平时忙的时候，做事效率都是被逼上去的；一旦闲下来，学习？学个 P！\n\n![](https://pic.yupi.icu/5563/202311041340241.jpeg)\n\n### 之后的目标\n\n从上大学后，我总是会习惯性地给自己定一些目标，感觉执行起来才会更有动力和效率一些。就好比在黑夜中航行，有了灯塔才有方向。\n\n今年上半年，我给自己定的几个目标如下：\n\n1. 投入更多的时间在工作和学习上，减少视频制作的时间投入（但不会停止分享）。再过 4 个月，不出意外的话，我将面临第一次晋升高级工程师的答辩，如果毕业两年就能晋升高级，毫无疑问是对我自己实力的证明。那些质疑我的人，我要好好打你们的脸！\n\n   但说实话，我现在慌得一批，因为高职级答辩往往需要有深入的辩题，不是说简单列举你的工作就能通过的了。然而我现在完全没有计划答辩要讲什么，只能先深入研究下别人的系统，然后找找突破口。\n\n2. 开创并维护好自己的付费知识圈子 —— 【编程导航】知识星球。目前还在审核中，即将开放，到时会发文通知并详细介绍，欢迎自学编程迷茫、想进步的同学提前加 **QQ 群 897288134** 获取 60 元优惠券（原价 300，提高门槛，混子别来）。\n\n   ![](https://pic.yupi.icu/5563/202311041340383.png)\n\n   **既然要做，就要做到最大最好，对大家有用才是硬道理！**\n\n3. 早睡早起，不能再一觉睡到快 10 点了，尽量在公司吃早饭，千万不要 “我变强了，也变秃了”。\n\n   \n\n------\n\n\n最后，我必须要说：中国女足牛逼！中国女足无敌！中国女足 YYDS！🇨🇳🇨🇳🇨🇳\n\n**坚持不懈，努力拼搏，永不放弃！**"}