{"data": "大家好，今天给大家分享的是[编程导航知识星球](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247524980&idx=2&sn=9ddcdb6c52aa096ed4c5ad0ced946a7d&chksm=e9c28583deb50c95f3c2665713a8bbc372c68332b3bfb846cf4b23af3f1cc07164832a291335&token=689599617&lang=zh_CN&scene=21#wechat_redirect)的晨曦同学的算法学习以及保研上岸经历：\n\n> 星球原文链接：https://wx.zsxq.com/dweb2/index/topic_detail/214851418418421\n\n## 一、前言：2021年的状况\n\n要总结 2022 年，必须先回顾 2021 年。2021 年上半年，是我想要提升必修课排名，却最终因为迷失在繁杂的事情中而失败的一段时间。\n\n下半年，已经大三的我决心要取得突破，先是将重心放在了数学竞赛上，接着自学 Java 技术，然后是疯狂参加各种活动来刷加分刷经历。最终的结果也不太让人满意：数学竞赛只有广东省三等奖；微信校园运营官活动因为我不想搞微信小程序开发，也没有发挥太大的作用；必修课排名还下跌了一名。\n![](https://files.mdnice.com/user/31817/d92694d7-3d62-44f0-bcab-9a4a2268e7fb.png)\n\n\n2021 年 12 月，我报名参加了蓝桥杯程序设计竞赛 C++ 大学 A 组，开始重新捡起因为退役而放下的 ACM 竞赛。就这样，时间在我每天上 AcWing 刷课、刷题的节奏中，来到了 2022 年。\n\n## 二、黎明前的黑暗：1月-3月\n\n大三寒假在 2021 年最后一天开始。2022年 1 月，我将 AcWing 的算法基础课完完整整地刷了一遍，对应的题目也认认真真做完了。\n\n2月份，我开始重头刷算法提高课，并在做题的同时，将题目的原理都思考了一遍。与此同时，我还报名了 PAT 甲级，打算用来作为蓝桥杯的演练，找一下比赛的感觉。\n\n在 2 月底，我把 PAT 的练习题刷了个七七八八，被 PAT 题目毒瘤的要求卡得十分无语。\n\n到了3月，我在参加 PAT 甲级时，却在比赛中途因为手机热点掉线而直接被驱逐。无奈之下，我只能重新回到 AcWing，继续刷算法提高课、蓝桥杯辅导课。\n\n## 三、沉淀后的爆发：4月-7月\n\n4 月，我终于迎来了蓝桥杯。比赛过程中的体验十分不好，填空题理解错了题意，算法题只有两三题写出了正解，其他的都是假算法。最终我也只有省二，无缘国赛。\n\n5 月，我先是参加了 ACM 校赛。这次的比赛体验可以说是有史以来最好的，我一个人就解决了 4 题。最后我们队以 6 题的成绩拿到了二等奖，也算是实现了我们队在 ACM 比赛中获奖的愿望。我和我两个队友在进入大三就退役了，这次能拿奖还真是意想不到。\n\n接着是“天翼之星”高校创新赛。题目都很经典，甚至样例都一模一样。可惜最后一题我把判断条件写错了，没能拿全对。\n\n然后是学院的 ACM 院赛。但这一次我的一名队友因为课程安排冲突了就没有参加，我跟另一个队友只拿了个优胜奖。\n\n6 月，我先是通过了校内实习的面试。然后就是全身心备战本校的夏令营。每天都去课室写材料、背材料。日子就在忐忑不安中过去了。6 月底，我开始联系导师、报名夏令营。最后，导师确定了，夏令营也入选了。\n\n7 月，最关键的时刻到来了。7 月 7 日，夏令营演练、开幕、介绍导师。7 月 8 日上午，夏令营面试正式开始。为了能不被舍友打扰，在面试时更好地发挥，我特意去看了离校毕业生留下来的空宿舍，选了一间最干净的并做好了伪装（从外面看着像是还有人住在里面）。7 月 8 日早上，我不到六点就醒了，赶紧去饭堂吃了早餐，就马上赶到那个空宿舍把门反锁，并挂上免扰牌（因为我已经知道我的伪装已经被人看穿了）。\n\n随后就是等待面试开始。面试的过程中，我发挥得还算正常，而且结束得出乎意料的快。当时我就觉得无论结果如何，我都可以先歇一下了，至少先回去睡个觉......\n\n\n![](https://files.mdnice.com/user/31817/7fc62133-70fb-4085-911c-97db665a1cd6.png)\n\n\n7 月 8 日下午，公布优秀营员名单。当我看到我的名字排在名单第五位的时候，我简直不敢相信。我终于成功了，只要我能拿到保研名额，我就可以保研了。这一次，我终于体会到了计划成功实施的感觉。\n\n\n## 四、平静中的过渡：7月-8月\n\n这段时间，主要是完成过渡工作。首先是用作毕业的校内实习项目，然后是导师安排的工作（没错！已经要开始给导师打工了！）。不过这两样工作同时开始我是真的有些吃不消，甚至心态都很爆炸。不过也这是这段时间，促使我的能力向工程化的方向转变。\n\n7 月底，完成“天翼之星”高校创新赛决赛，最后获得网络安全组全国二等奖。8 月底，短暂的假期又要被实训占用。就这样，熬到了9月份。\n\n## 五、努力后的收获：9月\n\n9 月，先是综测开奖。我凭借着一堆的竞赛获奖和活动加分，以 0.02 分的优势硬生生拿到了总分第一名，随后拿到了最高的企业奖学金（1 w，比国奖的 8k 还多）。然后是保研开奖，我有惊无险地拿到了保研名额，顺利保研本校本院（华南理工大学软件学院）。一直以来的努力和坚持，终于迎来了收获。\n\n## 六、新的征程：10月-12月\n\n成功保研后，我成为了一名准研究生，也开始成为导师实验室的核心人员。导师新接了一个合作项目：跟国创中心一起研发嵌入式数据库。而我就成为了这个项目的中坚力量。经过一段时间的摸索、思考和规划，我又要迈向新的征程了。\n\n回想整个 2022，真的感概万千。有时候，有些事情，或许其本身真的另有深意。如果我没有加入[编程导航知识星球](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247524980&idx=2&sn=9ddcdb6c52aa096ed4c5ad0ced946a7d&chksm=e9c28583deb50c95f3c2665713a8bbc372c68332b3bfb846cf4b23af3f1cc07164832a291335&token=1681036854&lang=zh_CN&scene=21#wechat_redirect)，我也就不会拿着魔改的用户中心项目去参加比赛混了个0.5加分（doge），那么我也就拿不到综测总分第一，奖学金也拿不到这么高的金额。\n\n如果我当初没有决心去学 Java，没有去参加学校实验室的一个 Java 项目，我也就不会发现其实我并不喜欢Java，现在也就不会决心去学 C++。\n\n如果我 PAT 甲级参赛时没有遇到手机热点断网的问题，我就可能永远都考虑不到这个问题，就有可能在后面的蓝桥杯或者夏令营面试中炸雷。\n\n如果我没有参加蓝桥杯，我也就不会把 AcWing 的算法课从头到尾都刷一遍，也就不会在算法上取得突破，后面的 ACM 校赛院赛也不可能得奖，我的简历也就会很单薄，夏令营的材料就会少了不少内容......有时候我真的很感叹，明明我大一寒假就买了 AcWing 的课，为什么当初不踏实地把它全部刷完，这样说不定就能打进区域赛了（刷完算法提高课，真的感觉像蜕变了一样）。\n\n当初加入[星球](https://mp.weixin.qq.com/s?__biz=MzI1NDczNTAwMA==&mid=2247524980&idx=2&sn=9ddcdb6c52aa096ed4c5ad0ced946a7d&chksm=e9c28583deb50c95f3c2665713a8bbc372c68332b3bfb846cf4b23af3f1cc07164832a291335&token=1681036854&lang=zh_CN&scene=21#wechat_redirect)时，我在自我介绍中设立了三个目标：短期目标是蓝桥杯获奖，中期目标是保研成功，长期目标是进入大厂。现在短期目标和中期目标都实现了。\n\n至于长期目标，现在我对大厂的向往没有那么强烈了，开始考虑稳定的工作，就把长期目标改为“找到满意的工作”吧。但无论作出哪种选择，我都会不断提升自己的能力。踏实走好每一步，才能更好地抓住机会。\n\n2023年，希望能变得更好。\n\n## 加入星球\n\n更多内容加入星球可见，欢迎大家：\n\n[👉🏻 点此加入星球](https://yuyuanweb.feishu.cn/wiki/SDtMwjR1DituVpkz5MLc3fZLnzb)\n\n![微信扫码领券加入](https://www.codefather.cn/img/%E7%9F%A5%E8%AF%86%E6%98%9F%E7%90%83%E6%89%AB%E7%A0%81.jpeg)\n"}